Repository: routersys/YMM4-ObjLoader
Catalog: ObjLoader/Localization/Texts.*.resx
Languages: ar_sa, es_es, id_id, ko_kr, zh_cn, zh_tw

# ShaderParser_UnterminatedString
source: Unterminated string literal
id_id: String literal tidak ditutup
ko_kr: 문자열 리터럴이 닫히지 않았습니다
zh_cn: 字符串字面量未终止
zh_tw: 字串常值未終止

# ShaderParser_ExpectedTextFound
source: Expected '{0}' but found '{1}'
id_id: Diharapkan '{0}' tetapi ditemukan '{1}'
ko_kr: '{0}'이(가) 필요하지만 '{1}'을(를) 찾았습니다
zh_cn: 需要'{0}'但找到'{1}'
zh_tw: 需要'{0}'但找到'{1}'

# ShaderParser_ExpectedTypeFound
source: Expected {0} but found {1}
id_id: Diharapkan {0} tetapi ditemukan {1}
ko_kr: {0}이(가) 필요하지만 {1}을(를) 찾았습니다
zh_cn: 需要{0}但找到{1}
zh_tw: 需要{0}但找到{1}

# ShaderParser_ExpectedTypeButFoundText
source: Expected type but found '{0}'
id_id: Diharapkan tipe tetapi ditemukan '{0}'
ko_kr: 타입이 필요하지만 '{0}'을(를) 찾았습니다
zh_cn: 需要类型但找到'{0}'
zh_tw: 需要類型但找到'{0}'

# ShaderConversion_ParsingFailed
source: Shader parsing failed: {0} at line {1} column {2}
id_id: Parsing shader gagal: {0} di baris {1} kolom {2}
ko_kr: 셰이더 파싱 실패: {0} (줄: {1}、열: {2})
zh_cn: 着色器解析失败: {0} 在第{1}行第{2}列
zh_tw: 著色器解析失敗: {0} 在第{1}行第{2}列

# ShaderConversion_ConversionFailed
source: Shader conversion failed: {0}
id_id: Konversi shader gagal: {0}
ko_kr: 셰이더 변환 실패: {0}
zh_cn: 着色器转换失败: {0}
zh_tw: 著色器轉換失敗: {0}

# ShaderConversion_ArgumentNull
source: Argument cannot be null
id_id: Argumen tidak boleh null
ko_kr: 인수가 null일 수 없습니다
zh_cn: 参数不能为空
zh_tw: 參數不能為空

# ShaderConversion_SourceCodeEmpty
source: Source code cannot be empty
id_id: Kode sumber tidak boleh kosong
ko_kr: 소스 코드가 비어 있을 수 없습니다
zh_cn: 源代码不能为空
zh_tw: 原始碼不能為空

# ShaderError_Category_Syntax
source: Syntax Error
id_id: Kesalahan Sintaks
ko_kr: 구문 오류
zh_cn: 语法错误
zh_tw: 語法錯誤

# ShaderError_Category_Compilation
source: Compilation Error
id_id: Kesalahan Kompilasi
ko_kr: 컴파일 오류
zh_cn: 编译错误
zh_tw: 編譯錯誤

# ShaderError_Category_Conversion
source: Conversion Error
id_id: Kesalahan Konversi
ko_kr: 변환 오류
zh_cn: 转换错误
zh_tw: 轉換錯誤

# ShaderError_Category_General
source: General Error
id_id: Kesalahan Umum
ko_kr: 일반 오류
zh_cn: 常规错误
zh_tw: 一般錯誤

# ShaderError_Location
source: Location
id_id: Lokasi
ko_kr: 위치
zh_cn: 位置
zh_tw: 位置

# ShaderError_Line
source: Line
id_id: Baris
ko_kr: 줄
zh_cn: 行
zh_tw: 行

# ShaderError_Column
source: Column
id_id: Kolom
ko_kr: 열
zh_cn: 列
zh_tw: 列

# ShaderError_Message
source: Error Message
id_id: Pesan Kesalahan
ko_kr: 오류 메시지
zh_cn: 错误消息
zh_tw: 錯誤訊息

# ShaderError_CodeContext
source: Code Context
id_id: Konteks Kode
ko_kr: 코드 컨텍스트
zh_cn: 代码上下文
zh_tw: 程式碼內容

# ShaderError_File
source: File
ko_kr: 파일
zh_cn: 文件
zh_tw: 檔案

# ShaderError_ValidationTime
source: Validation Time
id_id: Waktu Validasi
ko_kr: 검증 시간
zh_cn: 验证时间
zh_tw: 驗證時間

# ShaderError_DialogTitle
source: Shader Error Details
id_id: Detail Kesalahan Shader
ko_kr: 셰이더 오류 세부정보
zh_cn: 着色器错误详情
zh_tw: 著色器錯誤詳情

source: SSR Max Steps
id_id: Langkah Maks SSR
ko_kr: SSR 최대 단계
zh_cn: SSR最大步数
zh_tw: SSR最大步數

# SSRMaxSteps_Desc
source: Number of ray marching iterations for screen-space reflections
id_id: Jumlah iterasi ray marching (lebih tinggi = kualitas lebih baik tapi lebih lambat)
ko_kr: 레이 마칭 반복 횟수 (높을수록 품질 향상하지만 느림)
zh_cn: 光线行进迭代次数（越高质量越好但越慢）
zh_tw: 光線行進迭代次數（越高品質越好但越慢）

source: SSR Depth Threshold
id_id: Ambang kedalaman SSR
ko_kr: SSR 깊이 임계값
zh_cn: SSR深度阈值
zh_tw: SSR深度閾值

# SSRDepthThreshold_Desc
source: Depth buffer tolerance for ray hit detection
id_id: Toleransi buffer kedalaman untuk deteksi hit
ko_kr: 레이 적중 감지를 위한 깊이 버퍼 허용 오차
zh_cn: 光线命中检测的深度缓冲容差
zh_tw: 光線命中檢測的深度緩衝容差

# Material_Group_Standard
source: Standard
id_id: Standar
ko_kr: 표준
zh_cn: 标准
zh_tw: 標準

# Material_Roughness
source: Roughness
id_id: Kekasaran
ko_kr: 거칠기
zh_cn: 粗糙度
zh_tw: 粗糙度

# Material_Metallic
source: Metallic
ko_kr: 메탈릭
zh_cn: 金属度
zh_tw: 金屬度

# Material_BaseColor
source: Base Color
id_id: Warna Dasar
ko_kr: 기본 색상
zh_cn: 基本色
zh_tw: 基本色

# Tip_SavePreset
source: Save Preset
id_id: Simpan Preset
ko_kr: 프리셋 저장
zh_cn: 保存预设
zh_tw: 保存預設

# Tip_LoadPreset
source: Load Preset
id_id: Muat Preset
ko_kr: 프리셋 불러오기
zh_cn: 加载预设
zh_tw: 載入預設

# Tip_ResetMaterial
source: Reset Material
ko_kr: 재질 초기화
zh_cn: 重置材质
zh_tw: 重置材質

# Tip_ResetGroup
source: Reset Group
id_id: Reset Grup
ko_kr: 그룹 초기화
zh_cn: 重置组
zh_tw: 重置群組

# Settings_3DModel
source: 3D Model
id_id: Model 3D
zh_cn: 3D模型
zh_tw: 3D模型

source: Sandbox Settings
id_id: Pengaturan Kotak Pasir
zh_cn: 沙盒设置
zh_tw: 沙盒設定

source: Enable Sandbox
id_id: Aktifkan Sandbox
zh_cn: 启用沙盒
zh_tw: 啟用沙盒

source: Allowed Directories
id_id: Direktori yang Diizinkan
zh_cn: 允许的目录
zh_tw: 允許的目錄

# AddDirectory
source: Add
id_id: Tambah
zh_cn: 添加
zh_tw: 新增

# RemoveDirectory
source: Remove
id_id: Hapus
zh_cn: 删除
zh_tw: 刪除

# ClearDirectories
source: Clear
id_id: Bersihkan
zh_cn: 清除
zh_tw: 清除

source: Resource Management
id_id: Manajemen Sumber Daya
zh_cn: 资源管理
zh_tw: 資源管理

# AuditInterval
source: Audit Interval (min)
id_id: Interval Audit (mnt)
zh_cn: 审计间隔 (分钟)
zh_tw: 審計間隔 (分鐘)

# LeakThreshold
source: Leak Threshold (min)
id_id: Ambang Kebocoran (mnt)
zh_cn: 泄漏阈值 (分钟)
zh_tw: 洩漏閾值 (分鐘)

source: Enable Auto Audit
id_id: Aktifkan Audit Otomatis
zh_cn: 启用自动审计
zh_tw: 啟用自動審計

# RunAudit
source: Run Audit Now
id_id: Jalankan Audit Sekarang
zh_cn: 立即运行审计
zh_tw: 立即執行審計

source: Audit Results
id_id: Hasil Audit
zh_cn: 审计结果
zh_tw: 審計結果

source: Active Resources:
id_id: Sumber Daya Aktif:
zh_cn: 活动资源:
zh_tw: 活動資源:

source: Orphaned Resources:
id_id: Sumber Daya Yatim:
zh_cn: 孤立资源:
zh_tw: 孤立資源:

source: Total Allocations:
id_id: Total Alokasi:
zh_cn: 总分配数:
zh_tw: 總分配數:

source: Total Disposals:
id_id: Total Pembuangan:
zh_cn: 总释放数:
zh_tw: 總釋放數:

# EstimatedActiveBytes
source: Estimated Active Size (B):
id_id: Perkiraan Ukuran Aktif (B):
zh_cn: 估计活动大小 (B):
zh_tw: 估計活動大小 (B):

# LeakedResourcesList
source: Potentially Leaked Resources
id_id: Sumber Daya Berpotensi Bocor
zh_cn: 可能泄漏的资源
zh_tw: 可能洩漏的資源

source: Orphaned Resources List
id_id: Daftar Sumber Daya Yatim
zh_cn: 孤立资源列表
zh_tw: 孤立資源列表

# KeyHeader
source: Key
id_id: Kunci
zh_cn: 键
zh_tw: 鍵

# TypeHeader
source: Type
id_id: Tipe
zh_cn: 类型
zh_tw: 類型

# AgeHeader
source: Age
id_id: Usia
zh_cn: 时长
zh_tw: 時長

# SizeHeader
source: Size
id_id: Ukuran
zh_cn: 大小
zh_tw: 大小

# StackTraceHeader
source: Stack Trace
zh_cn: 堆栈跟踪
zh_tw: 堆疊追蹤

# CreatedAtHeader
source: Created At
id_id: Dibuat Pada
zh_cn: 创建时间
zh_tw: 建立時間

source: Resource Limits
id_id: Batas Sumber Daya
zh_cn: 资源限制
zh_tw: 資源限制

# ResourceLimitTitle
source: Resource Limit
id_id: Batas Sumber Daya
zh_cn: 资源限制
zh_tw: 資源限制

# ComplexityLimits
source: Model Complexity Limits
id_id: Batas Kompleksitas Model
zh_cn: 模型复杂度限制
zh_tw: 模型複雜度限制

# MaxFileSizeMB
source: Max File Size
id_id: Ukuran File Maksimum
zh_cn: 最大文件大小
zh_tw: 最大檔案大小

# MaxGpuMemoryPerModelMB
source: Max GPU Memory per Model
id_id: Memori GPU Maks. per Model
zh_cn: 每个模型最大GPU内存
zh_tw: 每個模型最大GPU記憶體

# MaxTotalGpuMemoryMB
source: Max Total GPU Memory
id_id: Total Memori GPU Maksimum
zh_cn: 最大总GPU内存
zh_tw: 最大總GPU記憶體

source: Max Vertices
id_id: Maks. Vertex
zh_cn: 最大顶点数
zh_tw: 最大頂點數

source: Max Indices
id_id: Maks. Indeks
zh_cn: 最大索引数
zh_tw: 最大索引數

source: Max Parts
id_id: Maks. Bagian
zh_cn: 最大部件数
zh_tw: 最大部件數

# FileSizeExceeded
source: {0} file size ({1} MB) exceeds the limit ({2} MB). You can change the limit in Model Settings.
id_id: Ukuran file {0} ({1} MB) melebihi batas ({2} MB). Anda dapat mengubah batas di Pengaturan Model.
zh_cn: 文件 {0} 的大小 ({1} MB) 超过了限制 ({2} MB)。您可以在模型设置中更改限制。
zh_tw: 檔案 {0} 的大小 ({1} MB) 超過了限制 ({2} MB)。您可以在模型設定中變更限制。

# GpuMemoryExceeded
source: {0} GPU memory usage ({1} MB) exceeds the limit ({2} MB). You can change the limit in Model Settings.
id_id: Penggunaan memori GPU {0} ({1} MB) melebihi batas ({2} MB). Anda dapat mengubah batas di Pengaturan Model.
zh_cn: 文件 {0} 的GPU内存使用 ({1} MB) 超过了限制 ({2} MB)。您可以在模型设置中更改限制。
zh_tw: 檔案 {0} 的GPU記憶體使用 ({1} MB) 超過了限制 ({2} MB)。您可以在模型設定中變更限制。

# VertexCountExceeded
source: {0} vertex count ({1}) exceeds the limit ({2}). You can change the limit in Model Settings.
id_id: Jumlah vertex file {0} ({1}) melebihi batas ({2}). Anda dapat mengubah batas di Pengaturan Model.
zh_cn: 文件 {0} 的顶点数 ({1}) 超过了限制 ({2})。您可以在模型设置中更改限制。
zh_tw: 檔案 {0} 的頂點數 ({1}) 超過了限制 ({2})。您可以在模型設定中變更限制。

# IndexCountExceeded
source: {0} index count ({1}) exceeds the limit ({2}). You can change the limit in Model Settings.
id_id: Jumlah indeks file {0} ({1}) melebihi batas ({2}). Anda dapat mengubah batas di Pengaturan Model.
zh_cn: 文件 {0} 的索引数 ({1}) 超过了限制 ({2})。您可以在模型设置中更改限制。
zh_tw: 檔案 {0} 的索引數 ({1}) 超過了限制 ({2})。您可以在模型設定中變更限制。

# PartCountExceeded
source: {0} part count ({1}) exceeds the limit ({2}). You can change the limit in Model Settings.
id_id: Jumlah bagian file {0} ({1}) melebihi batas ({2}). Anda dapat mengubah batas di Pengaturan Model.
zh_cn: 文件 {0} 的部件数 ({1}) 超过了限制 ({2})。您可以在模型设置中更改限制。
zh_tw: 檔案 {0} 的部件數 ({1}) 超過了限制 ({2})。您可以在模型設定中變更限制。

# SandboxBlocked
source: Access to {0} was blocked by sandbox. Please add an allowed directory in Model Settings.
id_id: Akses ke {0} diblokir oleh sandbox. Silakan tambahkan direktori yang diizinkan di Pengaturan Model.
zh_cn: 沙箱阻止了对 {0} 的访问。请在模型设置中添加允许的目录。
zh_tw: 沙箱阻止了對 {0} 的存取。請在模型設定中新增允許的目錄。

source: Reset value
id_id: Atur ulang nilai
zh_tw: 重設值

source: Reset resource limits
id_id: Atur ulang batas sumber daya
zh_tw: 重設資源限制

source: Reset complexity limits
id_id: Atur ulang batas kompleksitas
zh_tw: 重設複雜性限制

source: Reset audit settings
id_id: Atur ulang pengaturan audit
zh_tw: 重設審核設定

# Title_LoadError
source: Texture Load Error
id_id: Kesalahan Memuat Tekstur
zh_tw: 紋理載入錯誤

# Error_DdsInvalidMagic
source: Invalid DDS file (Incorrect Magic Number)
id_id: File DDS tidak valid (Nomor Magic salah)
zh_tw: 無效的DDS檔案（Magic Number 不正確）

# Error_DdsInvalidHeaderSize
source: Invalid DDS header size
id_id: Ukuran header DDS salah
zh_tw: DDS標頭大小不正確

# Error_DdsCompressedNotSupported
source: Compressed DDS format not supported for CPU decoding: {0}
id_id: Format DDS terkompresi tidak didukung untuk decoding CPU: {0}
zh_tw: 不支援CPU解碼的壓縮DDS格式：{0}

# Error_DdsFormatNotSupported
source: Unsupported DDS format (Only RGB/RGBA)
id_id: Format DDS tidak didukung (Hanya RGB/RGBA)
zh_tw: 不支援的DDS格式（僅RGB/RGBA）

# Error_DdsBitDepthNotSupported
source: Unsupported DDS bit depth (Only 24/32-bit)
id_id: Kedalaman bit DDS tidak didukung (Hanya 24/32-bit)
zh_tw: 不支援的DDS位元深度（僅24/32位元）

# Error_DdsDataReadFailed
source: Failed to read DDS pixel data
id_id: Gagal membaca data piksel DDS
zh_tw: 讀取DDS像素數據失敗

# Error_PsdInvalidSignature
source: Invalid PSD file (Incorrect Signature)
id_id: File PSD tidak valid (Tanda tangan salah)
zh_tw: 無效的PSD檔案（簽名不正確）

# Error_PsdVersionNotSupported
source: Unsupported PSD version (Only Version 1)
id_id: Versi PSD tidak didukung (Hanya Versi 1)
zh_tw: 不支援的PSD版本（僅版本1）

# Error_PsdColorModeNotSupported
source: Unsupported PSD color mode (Only RGB)
id_id: Mode warna PSD tidak didukung (Hanya RGB)
zh_tw: 不支援的PSD顏色模式（僅RGB）

# Error_PsdBitDepthNotSupported
source: Unsupported PSD bit depth (Only 8-bit)
id_id: Kedalaman bit PSD tidak didukung (Hanya 8-bit)
zh_tw: 不支援的PSD位元深度（僅8位元）

# Error_PsdInsufficientChannels
source: Insufficient PSD channels (Minimum 3)
id_id: Saluran PSD tidak cukup (Minimal 3)
zh_tw: PSD通道不足（至少3個）

# Error_PsdCompressionNotSupported
source: Unsupported PSD compression format
id_id: Format kompresi PSD tidak didukung
zh_tw: 不支援的PSD壓縮格式

# Error_DimensionsInvalid
source: Invalid image dimensions
id_id: Dimensi gambar tidak valid
zh_tw: 圖像尺寸無效

# Error_DimensionsTooLarge
source: Image dimensions too large for memory
id_id: Dimensi gambar terlalu besar untuk memori
zh_tw: 圖像尺寸過大，無法載入

# DracoNotSupported
source: Draco compression is not supported
id_id: Kompresi Draco tidak didukung

# Timeline_Play
source: 再生
ar_sa: شغل
es_es: Reproducir
id_id: Putar
ko_kr: Mainkan
