Repository: routersys/YMM4-ObjLoader
Catalog: ObjLoader/Localization/Texts.*.resx
Languages: ar_sa, es_es, id_id, ko_kr, zh_cn, zh_tw

# CurrentCulture
source: en-us
ar_sa: ar-sa
es_es: es-es
id_id: id-id
ko_kr: ko-kr
zh_cn: zh-cn
zh_tw: zh-tw

# PluginName
source: OBJ Model
ar_sa: نموذج OBJ
es_es: Modelo OBJ
id_id: Model OBJ
ko_kr: OBJ 모델
zh_cn: OBJ模型
zh_tw: OBJ模型

source: Coordinate System
ar_sa: نظام الإحداثيات
es_es: Sistema de coordenadas
id_id: Sistem Koordinat
ko_kr: 좌표계
zh_cn: 坐标系
zh_tw: 座標系

# CoordinateSystem_Desc
source: Sets the orientation of the coordinate axes when loading the model.
ar_sa: يحدد اتجاه محاور الإحداثيات عند تحميل النموذج.
es_es: Establece la orientación de los ejes de coordenadas al cargar el modelo.
id_id: Mengatur orientasi sumbu koordinat saat memuat model.
ko_kr: 모델 로드 시 좌표축의 방향을 설정합니다.
zh_cn: 设置加载模型时的坐标轴方向。
zh_tw: 設定載入模型時的座標軸方向。

# CoordinateSystem_RightHandedYUp
source: Right-Handed Y-Up (Default)
ar_sa: يد يمنى Y-Up (افتراضي)
es_es: Mano derecha Y-Up (Estándar)
id_id: Tangan Kanan Y-Up (Bawaan)
ko_kr: 오른손 좌표계 Y-Up (표준)
zh_cn: 右手系 Y-Up (标准)
zh_tw: 右手系 Y-Up (預設)

# CoordinateSystem_RightHandedZUp
source: Right-Handed Z-Up
ar_sa: يد يمنى Z-Up
es_es: Mano derecha Z-Up
id_id: Tangan Kanan Z-Up
ko_kr: 오른손 좌표계 Z-Up
zh_cn: 右手系 Z-Up
zh_tw: 右手系 Z-Up

# CoordinateSystem_LeftHandedYUp
source: Left-Handed Y-Up
ar_sa: يد يسرى Y-Up
es_es: Mano izquierda Y-Up
id_id: Tangan Kiri Y-Up
ko_kr: 왼손 좌표계 Y-Up
zh_cn: 左手系 Y-Up
zh_tw: 左手系 Y-Up

# CoordinateSystem_LeftHandedZUp
source: Left-Handed Z-Up
ar_sa: يد يسرى Z-Up
es_es: Mano izquierda Z-Up
id_id: Tangan Kiri Z-Up
ko_kr: 왼손 좌표계 Z-Up
zh_cn: 左手系 Z-Up
zh_tw: 左手系 Z-Up

# CullMode
source: Culling
ar_sa: إعدام
es_es: Recorte
id_id: Mode Culling
ko_kr: 컬링
zh_cn: 剔除
zh_tw: 剔除

# CullMode_Desc
source: Sets the culling mode for rendering.
ar_sa: يحدد وضع الإعدام للتصيير.
es_es: Establece el modo de recorte para el renderizado.
id_id: Mengatur mode culling saat merender.
ko_kr: 렌더링 시 컬링 모드를 설정합니다.
zh_cn: 设置渲染时的剔除模式。
zh_tw: 設定算繪時的剔除模式。

# CullMode_None
source: None
ar_sa: لا شيء
es_es: Ninguno
id_id: Tidak ada
ko_kr: 없음
zh_cn: 无
zh_tw: 無

# CullMode_Front
source: Front
ar_sa: أمام
es_es: Frente
id_id: Depan
ko_kr: 앞면
zh_cn: 正面
zh_tw: 正面

# CullMode_Back
source: Back
ar_sa: خلف
es_es: Dorso
id_id: Belakang
ko_kr: 뒷면
zh_cn: 背面
zh_tw: 背面

# Group_Global
source: Global Settings
ar_sa: الإعدادات العامة
es_es: Configuración global
id_id: Pengaturan Global
ko_kr: 전체 설정
zh_cn: 全局设置
zh_tw: 全域設定

# Group_Lighting
source: Lighting
ar_sa: إضاءة
es_es: Iluminación
id_id: Pencahayaan
ko_kr: 조명
zh_cn: 光照
zh_tw: 光照

source: Ambient Color
ar_sa: لون المحيط
es_es: Color ambiental
id_id: Warna Ambient
ko_kr: 앰비언트 색상
zh_cn: 环境光颜色
zh_tw: 環境光顏色

# AmbientColor_Desc
source: Sets the color of the ambient light.
ar_sa: يحدد لون الضوء المحيط.
es_es: Establece el color de la luz ambiental.
id_id: Mengatur warna cahaya ambient.
ko_kr: 환경광의 색상을 설정합니다.
zh_cn: 设置环境光的颜色。
zh_tw: 設定環境光的顏色。

source: Diffuse Intensity
ar_sa: كثافة الانتشار
es_es: Intensidad difusa
id_id: Intensitas Difus
ko_kr: 확산 반사 강도
zh_cn: 漫反射强度
zh_tw: 漫反射強度

# DiffuseIntensity_Desc
source: Sets the intensity of diffuse reflection.
ar_sa: يحدد كثافة الانعكاس المنتشر للضوء.
es_es: Establece la intensidad de la reflexión difusa.
id_id: Mengatur intensitas pantulan difus cahaya.
ko_kr: 빛의 확산 반사 강도를 설정합니다.
zh_cn: 设置光的漫反射强度。
zh_tw: 設定光的漫反射強度。

source: Specular Intensity
ar_sa: كثافة الانعكاس
es_es: Intensidad especular
id_id: Intensitas Specular
ko_kr: 정반사 강도
zh_cn: 镜面反射强度
zh_tw: 鏡面反射強度

# SpecularIntensity_Desc
source: Sets the intensity of specular reflection (highlights).
ar_sa: يحدد كثافة الانعكاس المرآوي (الإضاءة الساطعة).
es_es: Establece la intensidad de la reflexión especular (resaltados).
id_id: Mengatur intensitas pantulan specular (highlight).
ko_kr: 빛의 정반사(하이라이트) 강도를 설정합니다.
zh_cn: 设置光的镜面反射（高光）强度。
zh_tw: 設定光的鏡面反射（高光）強度。

source: Shininess
ar_sa: لمعان
es_es: Brillo
ko_kr: 광택도
zh_cn: 光泽度
zh_tw: 光澤度

# Shininess_Desc
source: Sets the sharpness of highlights. Higher values mean sharper highlights.
ar_sa: يحدد حدة الإضاءة الساطعة. القيم الأعلى تعني إضاءة أكثر حدة.
es_es: Establece la nitidez de los resaltados. Los valores más altos significan resaltados más nítidos.
id_id: Mengatur ketajaman highlight. Nilai lebih tinggi membuat lebih tajam.
ko_kr: 하이라이트의 선명도를 설정합니다. 값이 클수록 선명해집니다.
zh_cn: 设置高光的锐度。值越大越銳利。
zh_tw: 設定高光的銳利度。値越大越銳利。

# Group_Environment
source: Environment
ar_sa: بيئة
es_es: Entorno
id_id: Lingkungan
ko_kr: 환경
zh_cn: 环境
zh_tw: 環境

source: Light Color
ar_sa: لون الضوء
es_es: Color de la luz
id_id: Warna Cahaya
ko_kr: 조명 색상
zh_cn: 光源颜色
zh_tw: 光源顏色

# LightColor_Desc
source: Sets the color of the light source.
ar_sa: يحدد لون مصدر الضوء.
es_es: Establece el color de la fuente de luz.
id_id: Mengatur warna sumber cahaya.
ko_kr: 광원의 색상을 설정합니다.
zh_cn: 设置光源的颜色。
zh_tw: 設定光源的顏色。

# ResetDefaults
source: Reset to Defaults
ar_sa: إعادة تعيين الافتراضيات
es_es: Restablecer valores predeterminados
id_id: Kembalikan ke Default
ko_kr: 기본값으로 복원
zh_cn: 恢复默认值
zh_tw: 恢復預設值

source: OK
ar_sa: موافق
es_es: Aceptar
ko_kr: 확인
zh_cn: 确定
zh_tw: 確定

source: Cancel
ar_sa: إلغاء
es_es: Cancelar
id_id: Batal
ko_kr: 취소
zh_cn: 取消
zh_tw: 取消

# Group_Model
source: Model
ar_sa: نموذج
es_es: Modelo
ko_kr: 모델
zh_cn: 模型
zh_tw: 模型

# Setting
source: Settings
ar_sa: إعدادات
es_es: Configuración
id_id: Pengaturan
ko_kr: 설정
zh_cn: 设置
zh_tw: 設定

source: File
ar_sa: ملف
es_es: Archivo
ko_kr: 파일
zh_cn: 文件
zh_tw: 檔案

# File_Desc
source: pmx
ar_sa: Specifies the 3D model file to load. (obj
es_es: 3mf)
ko_kr: ply
zh_cn: stl
zh_tw: glb

source: Base Color
ar_sa: اللون الأساسي
es_es: Color base
id_id: Warna Dasar
ko_kr: 기본 색상
zh_cn: 基本色
zh_tw: 基本色

source: Projection
ar_sa: إسقاط
es_es: Proyección
id_id: Proyeksi
ko_kr: 투영 방법
zh_cn: 投影方法
zh_tw: 投影方法

# Group_Display
source: Display
ar_sa: عرض
es_es: Visualización
id_id: Tampilan
ko_kr: 표시
zh_cn: 显示
zh_tw: 顯示

source: Screen Width
ar_sa: عرض الشاشة
es_es: Ancho de pantalla
id_id: Lebar Layar
ko_kr: 화면 너비
zh_cn: 屏幕宽度
zh_tw: 螢幕寬度

source: Screen Height
ar_sa: ارتفاع الشاشة
es_es: Altura de pantalla
id_id: Tinggi Layar
ko_kr: 화면 높이
zh_cn: 屏幕高度
zh_tw: 螢幕高度

# Group_Placement
source: Placement
ar_sa: توضيع
es_es: Colocación
id_id: Penempatan
ko_kr: 배치
zh_cn: 配置
zh_tw: 配置

# X
source: Position X
ar_sa: الموضع س
es_es: Posición X
id_id: Posisi X
ko_kr: 위치 X
zh_cn: 位置 X
zh_tw: 位置 X

# Y
source: Position Y
ar_sa: الموضع ص
es_es: Posición Y
id_id: Posisi Y
ko_kr: 위치 Y
zh_cn: 位置 Y
zh_tw: 位置 Y

# Z
source: Position Z
ar_sa: الموضع ع
es_es: Posición Z
id_id: Posisi Z
ko_kr: 위치 Z
zh_cn: 位置 Z
zh_tw: 位置 Z

# Fov
source: Field of View
ar_sa: مجال الرؤية
es_es: Campo de visión
id_id: Sudut Pandang
ko_kr: 시야각
zh_cn: 视野角
zh_tw: 視野角

source: Scale
ar_sa: مقياس
es_es: Escala
id_id: Skala
ko_kr: 배율
zh_cn: 缩放
zh_tw: 縮放

source: Rotation X
ar_sa: تدوير س
es_es: Rotación X
id_id: Rotasi X
ko_kr: 회전 X
zh_cn: 旋转 X
zh_tw: 旋轉 X

source: Rotation Y
ar_sa: تدوير ص
es_es: Rotación Y
id_id: Rotasi Y
ko_kr: 회전 Y
zh_cn: 旋转 Y
zh_tw: 旋轉 Y

source: Rotation Z
ar_sa: تدوير ع
es_es: تدوير ع
id_id: Rotasi Z
ko_kr: 회전 Z
zh_cn: 旋轉 Z
zh_tw: 回転 Z

# ResetTrigger
source: Reset
ar_sa: إعادة تعيين
es_es: Restablecer
ko_kr: 재설정
zh_cn: 重置
zh_tw: 重置

# Group_Light
source: Light
ar_sa: ضوء
es_es: Luz
id_id: Lampu
ko_kr: 조명
zh_cn: 灯光
zh_tw: 燈光

# IsLightEnabled
source: Enabled
ar_sa: ممكن
es_es: Habilitado
id_id: Diaktifkan
ko_kr: 활성화
zh_cn: 启用
zh_tw: 啟用

# LightX
source: Position X
ar_sa: الموضع س
es_es: Posición X
id_id: Posisi X
ko_kr: 위치 X
zh_cn: 位置 X
zh_tw: 位置 X

# LightY
source: Position Y
ar_sa: الموضع ص
es_es: Posición Y
id_id: Posisi Y
ko_kr: 위치 Y
zh_cn: 位置 Y
zh_tw: 位置 Y

# LightZ
source: Position Z
ar_sa: الموضع ع
es_es: Posición Z
id_id: Posisi Z
ko_kr: 위치 Z
zh_cn: 位置 Z
zh_tw: 位置 Z

# Projection_Parallel
source: Parallel Projection
ar_sa: إسقاط متوازي
es_es: Proyección paralela
id_id: Proyeksi Paralel
ko_kr: 평행 투영
zh_cn: 平行投影
zh_tw: 平行投影

# Projection_Perspective
source: Perspective Projection
ar_sa: إسقاط منظوري
es_es: Proyección en perspectiva
id_id: Proyeksi Perspektif
ko_kr: 원근 투영
zh_cn: 透视投影
zh_tw: 透視投影

source: Reset Transform
ar_sa: إعادة تعيين التحويل
es_es: Restablecer transformación
ko_kr: 변형 재설정
zh_cn: 重置变形
zh_tw: 重置變形

# SettingsTitle
source: Settings
ar_sa: إعدادات
es_es: Configuración
id_id: Pengaturan
ko_kr: 설정
zh_cn: 设置
zh_tw: 設定

source: On
ar_sa: تشغيل
es_es: Encendido
id_id: Nyala
ko_kr: 켜짐
zh_cn: 开
zh_tw: 開

source: Off
ar_sa: إيقاف
es_es: Apagado
id_id: Mati
ko_kr: 꺼짐
zh_cn: 关
zh_tw: 關

# UpdateAvailableTitle
source: Update Available
ar_sa: تحديث متاح
es_es: Actualización disponible
id_id: Pembaruan Tersedia
ko_kr: 업데이트 가능
zh_cn: 更新可用
zh_tw: 更新可用

# UpdateAvailableMessage
source: A new version ({0}) is available. Do you want to open the download page?
ar_sa: يتوفر إصدار جديد ({0}). هل تريد فتح صفحة التنزيل؟
es_es: Hay una nueva versión ({0}) disponible. ¿Desea abrir la página de descarga?
id_id: Versi baru ({0}) tersedia. Buka halaman unduhan?
ko_kr: 새 버전 ({0})을 사용할 수 있습니다. 다운로드 페이지를 여시겠습니까?
zh_cn: 新版本 ({0}) 可用。是否打开下载页面？
zh_tw: 新版本 ({0}) 可用。是否打開下載頁面？

source: World ID
ar_sa: معرف العالم
es_es: ID de mundo
id_id: ID Dunia
ko_kr: 월드 ID
zh_cn: 世界ID
zh_tw: 世界ID

source: Camera Settings
ar_sa: إعدادات الكاميرا
es_es: Configuración de la cámara
id_id: Pengaturan Kamera
ko_kr: 카메라 설정
zh_cn: 相机设置
zh_tw: 相機設定

# OpenCameraWindow
source: Camera Position
ar_sa: موضع الكاميرا
es_es: Posición de la cámara
id_id: Posisi Kamera
ko_kr: 카메라 위치
zh_cn: 相机位置
zh_tw: 相機位置

source: Grid
ar_sa: شبكة
es_es: Cuadrícula
ko_kr: 그리드
zh_cn: 网格
zh_tw: 網格

source: Reset Camera
ar_sa: إعادة تعيين الكاميرا
es_es: Restablecer cámara
id_id: Reset Kamera
ko_kr: 카메라 재설정
zh_cn: 重置相机
zh_tw: 重置相機

# CameraPos
source: Camera Position
ar_sa: موضع الكاميرا
es_es: Posición de la cámara
id_id: Posisi Kamera
ko_kr: 카메라 위치
zh_cn: 相机位置
zh_tw: 相機位置

# CameraTarget
source: Target
ar_sa: الهدف
es_es: Objetivo
ko_kr: 목표
zh_cn: 目标
zh_tw: 目標

# ViewRight
source: Right
ar_sa: حق
es_es: Derecha
id_id: Kanan
ko_kr: 우
zh_cn: 右
zh_tw: 右

# ViewLeft
source: Left
ar_sa: اليسار
es_es: Izquierda
id_id: Kiri
ko_kr: 좌
zh_cn: 左
zh_tw: 左

# ViewTop
source: Top
ar_sa: أعلى
es_es: Arriba
id_id: Atas
ko_kr: 상
zh_cn: 上
zh_tw: 上

# ViewBottom
source: Bottom
ar_sa: أسفل
es_es: Abajo
id_id: Bawah
ko_kr: 하
zh_cn: 下
zh_tw: 下

# ViewFront
source: Front
ar_sa: أمامي
es_es: Frente
id_id: Depan
ko_kr: 전
zh_cn: 前
zh_tw: 前

# ViewBack
source: Back
ar_sa: خلف
es_es: Atrás
id_id: Belakang
ko_kr: 후
zh_cn: 后
zh_tw: 後

# CornerFRT
source: Front Right Top
ar_sa: الجبهة اليمنى العليا
es_es: Frente Derecha Arriba
id_id: Depan Kanan Atas
ko_kr: 전우상
zh_cn: 前右上
zh_tw: 前右上

# CornerFLT
source: Front Left Top
ar_sa: الجبهة اليسرى العليا
es_es: Frente Izquierda Arriba
id_id: Depan Kiri Atas
ko_kr: 전좌상
zh_cn: 前左上
zh_tw: 前左上

# CornerBRT
source: Back Right Top
ar_sa: الخلفية اليمنى العليا
es_es: Atrás Derecha Arriba
id_id: Belakang Kanan Atas
ko_kr: 후우상
zh_cn: 后右上
zh_tw: 後右上

# CornerBLT
source: Back Left Top
ar_sa: الخلفية اليسرى العليا
es_es: Atrás Izquierda Arriba
id_id: Belakang Kiri Atas
ko_kr: 후좌상
zh_cn: 后左上
zh_tw: 後左上

# CornerFRB
source: Front Right Bottom
ar_sa: الجبهة اليمنى السفلى
es_es: Frente Derecha Abajo
id_id: Depan Kanan Bawah
ko_kr: 전우하
zh_cn: 前右下
zh_tw: 前右下

# CornerFLB
source: Front Left Bottom
ar_sa: الجبهة اليسرى السفلى
es_es: Frente Izquierda Abajo
id_id: Depan Kiri Bawah
ko_kr: 전좌하
zh_cn: 前左下
zh_tw: 前左下

# CornerBRB
source: Back Right Bottom
ar_sa: الخلفية اليمنى السفلى
es_es: Atrás Derecha Abajo
id_id: Belakang Kanan Bawah
ko_kr: 후우하
zh_cn: 后右下
zh_tw: 後右下

# CornerBLB
source: Back Left Bottom
ar_sa: الخلفية اليسرى السفلى
es_es: Atrás Izquierda Abajo
id_id: Belakang Kiri Bawah
ko_kr: 후좌하
zh_cn: 后左下
zh_tw: 後左下

source: Pilot View
ar_sa: وجهة نظر الطيار
es_es: Vista de piloto
id_id: Tampilan Pilot
ko_kr: 파일럿 시점
zh_cn: 飞行员视角
zh_tw: 飛行員視角

source: Wireframe
ar_sa: إطار سلكي
es_es: Estructura de alambre
ko_kr: 와이어프레임
zh_cn: 线框
zh_tw: 線框

source: Snap
ar_sa: العض
es_es: Ajuste
ko_kr: 스냅
zh_cn: 吸附
zh_tw: 吸附

# Focus
source: Focus (F)
ar_sa: التركيز (F)
es_es: Enfoque (F)
id_id: Fokus (F)
ko_kr: 초점 (F)
zh_cn: 聚焦 (F)
zh_tw: 聚焦 (F)

source: Undo
ar_sa: تراجع
es_es: Deshacer
id_id: Urungkan
ko_kr: 실행 취소
zh_cn: 撤销
zh_tw: 復原

source: Redo
ar_sa: إعادة
es_es: Rehacer
id_id: Ulangi
ko_kr: 다시 실행
zh_cn: 重做
zh_tw: 重做

source: Solid
ar_sa: صلب
es_es: Sólido
id_id: Padat
ko_kr: 솔리드
zh_cn: 实体
zh_tw: 實體

source: Flat
ar_sa: مسطح
es_es: Plano
id_id: Datar
ko_kr: 플랫
zh_cn: 平坦
zh_tw: 平坦

source: Display Mode
ar_sa: وضع العرض
es_es: Modo de visualización
id_id: Mode Tampilan
ko_kr: 표시 모드
zh_cn: 显示模式
zh_tw: 顯示模式

source: Infinite Grid
ar_sa: شبكة لا نهائية
es_es: Cuadrícula infinita
id_id: Grid Tak Terbatas
ko_kr: 무한 그리드
zh_cn: 无限网格
zh_tw: 無限網格

# TargetFixed
source: Fixed
ar_sa: ثابت
es_es: Fijo
id_id: Tetap
ko_kr: 고정
zh_cn: 固定
zh_tw: 固定

# Timeline_Pause
source: 暂停
ar_sa: إيقاف مؤقت
es_es: Pausa
id_id: Jeda
ko_kr: Jeda
zh_cn: 暫停
zh_tw: 일시 정지

# Timeline_Stop
source: 停止
ar_sa: قف
es_es: Detener
id_id: Berhenti
ko_kr: Berhenti
zh_tw: 정지

# Timeline_AddKey
source: 添加关键帧
ar_sa: إضافة إطار رئيسي
es_es: Añadir fotograma clave
id_id: Tambah Keyframe
ko_kr: Tambahkan bingkai utama
zh_cn: 添加關鍵幀
zh_tw: 키 추가

# Timeline_RemoveKey
source: 删除关键帧
ar_sa: إزالة الإطار الرئيسي
es_es: Eliminar fotograma clave
id_id: Hapus Keyframe
ko_kr: Hapus bingkai utama
zh_cn: 刪除關鍵幀
zh_tw: 키 삭제

# Timeline_Easing
source: 缓动
ar_sa: تخفيف
es_es: Atenuación
id_id: Easing
ko_kr: Easing
zh_cn: 緩動
zh_tw: 이징

# Timeline_Time
source: 时间
ar_sa: وقت
es_es: Tiempo
id_id: Waktu
ko_kr: Waktu
zh_cn: 時間
zh_tw: 시간

# Timeline_Duration
source: 时长
ar_sa: المدة الزمنية
es_es: Duración
id_id: Durasi
ko_kr: Durasi
zh_cn: 長度
zh_tw: 길이

# Timeline_Seconds
source: 秒
ar_sa: ث
es_es: s
id_id: s
ko_kr: s
zh_tw: 초

# Preset_Save
source: 保存预设
ar_sa: حفظ الإعداد المسبق
es_es: Guardar ajuste preestablecido
id_id: Simpan Preset
ko_kr: Simpan Preset
zh_cn: 保存預設
zh_tw: 프리셋 저장

# Preset_Delete
source: 删除预设
ar_sa: حذف الإعداد المسبق
es_es: Eliminar ajuste preestablecido
id_id: Hapus Preset
ko_kr: Hapus Preset
zh_cn: 刪除預設
zh_tw: 프리셋 삭제

# Dialog_Name
source: 名称
ar_sa: اسم
es_es: Nombre
id_id: Nama
ko_kr: Nama
zh_cn: 名稱
zh_tw: 이름

# Dialog_Ok
source: 确定
ar_sa: موافق
es_es: Aceptar
id_id: OK
ko_kr: OK
zh_cn: 確定
zh_tw: 확인

# Dialog_Cancel
source: 取消
ar_sa: إلغاء
es_es: Cancelar
id_id: Batal
ko_kr: Batal
zh_tw: 취소

# Editor_ResetView
source: 重置视图
ar_sa: إعادة تعيين العرض
es_es: Restablecer vista
id_id: Reset Tampilan
ko_kr: Reset Tampilan
zh_cn: 重置視圖
zh_tw: 뷰 초기화

# Easing_Linear
source: Linear
ar_sa: خطي
es_es: Lineal
ko_kr: 선형
zh_cn: 线性
zh_tw: 線性

# Easing_SineIn
source: Sine In
ar_sa: جيب (In)
es_es: Seno In
ko_kr: 사인 (In)
zh_cn: 正弦 (In)
zh_tw: 正弦 (In)

# Easing_SineOut
source: Sine Out
ar_sa: جيب (Out)
es_es: Seno Out
ko_kr: 사인 (Out)
zh_cn: 正弦 (Out)
zh_tw: 正弦 (Out)

# Easing_SineInOut
source: Sine InOut
ar_sa: جيب (InOut)
es_es: Seno InOut
ko_kr: 사인 (InOut)
zh_cn: 正弦 (InOut)
zh_tw: 正弦 (InOut)

# Easing_QuadIn
source: Quad In
ar_sa: رباعي (In)
ko_kr: 쿼드 (In)
zh_cn: 二次 (In)
zh_tw: 二次 (In)

# Easing_QuadOut
source: Quad Out
ar_sa: رباعي (Out)
ko_kr: 쿼드 (Out)
zh_cn: 二次 (Out)
zh_tw: 二次 (Out)

# Easing_QuadInOut
source: Quad InOut
ar_sa: رباعي (InOut)
ko_kr: 쿼드 (InOut)
zh_cn: 二次 (InOut)
zh_tw: 二次 (InOut)

# Easing_CubicIn
source: Cubic In
ar_sa: مكعب (In)
es_es: Cúbico In
ko_kr: 큐빅 (In)
zh_cn: 三次 (In)
zh_tw: 三次 (In)

# Easing_CubicOut
source: Cubic Out
ar_sa: مكعب (Out)
es_es: Cúbico Out
ko_kr: 큐빅 (Out)
zh_cn: 三次 (Out)
zh_tw: 三次 (Out)

# Easing_CubicInOut
source: Cubic InOut
ar_sa: مكعب (InOut)
es_es: Cúbico InOut
ko_kr: 큐빅 (InOut)
zh_cn: 三次 (InOut)
zh_tw: 三次 (InOut)

# Easing_QuartIn
source: Quart In
ar_sa: الرابعة (In)
ko_kr: 쿼트 (In)
zh_cn: 四次 (In)
zh_tw: 四次 (In)

# Easing_QuartOut
source: Quart Out
ar_sa: الرابعة (Out)
ko_kr: 쿼트 (Out)
zh_cn: 四次 (Out)
zh_tw: 四次 (Out)

# Easing_QuartInOut
source: Quart InOut
ar_sa: الرابعة (InOut)
ko_kr: 쿼트 (InOut)
zh_cn: 四次 (InOut)
zh_tw: 四次 (InOut)

# Easing_QuintIn
source: Quint In
ar_sa: الخامسة (In)
ko_kr: 퀸트 (In)
zh_cn: 五次 (In)
zh_tw: 五次 (In)

# Easing_QuintOut
source: Quint Out
ar_sa: الخامسة (Out)
ko_kr: 퀸트 (Out)
zh_cn: 五次 (Out)
zh_tw: 五次 (Out)

# Easing_QuintInOut
source: Quint InOut
ar_sa: الخامسة (InOut)
ko_kr: 퀸트 (InOut)
zh_cn: 五次 (InOut)
zh_tw: 五次 (InOut)

# Easing_ExpoIn
source: Expo In
ar_sa: إكسبو (In)
ko_kr: 엑스포 (In)
zh_cn: 指数 (In)
zh_tw: 指數 (In)

# Easing_ExpoOut
source: Expo Out
ar_sa: إكسبو (Out)
ko_kr: 엑스포 (Out)
zh_cn: 指数 (Out)
zh_tw: 指數 (Out)

# Easing_ExpoInOut
source: Expo InOut
ar_sa: إكسبو (InOut)
ko_kr: 엑스포 (InOut)
zh_cn: 指数 (InOut)
zh_tw: 指數 (InOut)

# Easing_CircIn
source: Circ In
ar_sa: دائري (In)
ko_kr: 서클 (In)
zh_cn: 圆形 (In)
zh_tw: 圓形 (In)

# Easing_CircOut
source: Circ Out
ar_sa: دائري (Out)
ko_kr: 서클 (Out)
zh_cn: 圆形 (Out)
zh_tw: 圓形 (Out)

# Easing_CircInOut
source: Circ InOut
ar_sa: دائري (InOut)
ko_kr: 서클 (InOut)
zh_cn: 圆形 (InOut)
zh_tw: 圓形 (InOut)

# Easing_BackIn
source: Back In
ar_sa: عودة (In)
ko_kr: 백 (In)
zh_cn: 回退 (In)
zh_tw: 回退 (In)

# Easing_BackOut
source: Back Out
ar_sa: عودة (Out)
ko_kr: 백 (Out)
zh_cn: 回退 (Out)
zh_tw: 回退 (Out)

# Easing_BackInOut
source: Back InOut
ar_sa: عودة (InOut)
ko_kr: 백 (InOut)
zh_cn: 回退 (InOut)
zh_tw: 回退 (InOut)

# Preset_Standard
source: Standard
ar_sa: قياسي
es_es: Estándar
id_id: Standar
ko_kr: 표준
zh_cn: 标准
zh_tw: 標準

# Preset_Custom
source: Custom
ar_sa: مخصص
es_es: Personalizado
id_id: Kustom
ko_kr: 사용자 지정
zh_cn: 自定义
zh_tw: 自定義

source: Shader
ar_sa: مظلل
es_es: Sombreador
ko_kr: 셰이더
zh_cn: 着色器
zh_tw: 著色器

# Shader_Desc
source: fx
ar_sa: frag
es_es: vert
id_id: txt)
ko_kr: glsl
zh_cn: shader
zh_tw: cg

# Shader_Status_Success
source: Compilation Success
ar_sa: نجاح التحويل البرمجي
es_es: Compilación exitosa
id_id: Kompilasi Berhasil
ko_kr: 컴파일 성공
zh_cn: 编译成功
zh_tw: 編譯成功

# Shader_Status_Error
source: Compile Error: {0}
ar_sa: خطأ في التحويل البرمجي: {0}
es_es: Error de compilación: {0}
id_id: Kesalahan kompilasi: {0}
ko_kr: 컴파일 오류: {0}
zh_cn: 编译错误: {0}
zh_tw: 編譯錯誤: {0}

# Shader_Status_Unknown
source: Unknown
ar_sa: مجهول
es_es: Desconocido
id_id: Tidak diketahui
ko_kr: 알 수 없음
zh_cn: 未知
zh_tw: 未知

# Shader_None
source: None
ar_sa: لا شيء
es_es: Ninguno
id_id: Tidak ada
ko_kr: 없음
zh_cn: 无
zh_tw: 無

# Group_Toon
source: Toon
ar_sa: تون
ko_kr: 툰
zh_cn: 卡通
zh_tw: 卡通

# ToonEnabled
source: Enable Toon
ar_sa: تمكين تون
es_es: Habilitar Toon
id_id: Aktifkan Toon
ko_kr: 툰 활성화
zh_cn: 启用卡通
zh_tw: 啟用卡通

# ToonEnabled_Desc
source: Enables toon shading.
ar_sa: يمكّن تظليل تون.
es_es: Habilita el sombreado toon.
id_id: Mengaktifkan toon shading.
ko_kr: 툰 셰이딩을 활성화합니다.
zh_cn: 启用卡通着色。
zh_tw: 啟用卡通著色。

# ToonSteps
source: Steps
ar_sa: خطوات
es_es: Pasos
id_id: Langkah
ko_kr: 단계 수
zh_cn: 色阶数
zh_tw: 色階數

# ToonSteps_Desc
source: Sets the number of color bands.
ar_sa: يحدد عدد نطاقات الألوان.
es_es: Establece el número de bandas de color.
id_id: Mengatur jumlah tingkatan warna. Nilai kecil membuat tampilan lebih kartun.
ko_kr: 색상 단계 수를 설정합니다.
zh_cn: 设置色阶数量。
zh_tw: 設定色階數量。

# ToonSmoothness
source: Smoothness
ar_sa: نعومة
es_es: Suavidad
id_id: Kelancaran
ko_kr: 매끄러움
zh_cn: 平滑度
zh_tw: 平滑度

# ToonSmoothness_Desc
source: Sets the smoothness of the color bands boundaries.
ar_sa: يحدد نعومة حدود نطاقات الألوان.
es_es: Establece la suavidad de los límites de las bandas de color.
id_id: Mengatur seberapa halus batas tingkatan warna.
ko_kr: 색상 단계 경계의 부드러움을 설정합니다.
zh_cn: 设置色阶边界的平滑度。
zh_tw: 設定色階邊界的平滑度。

# Group_Rim
source: Rim Light
ar_sa: ضوء الحافة
es_es: Luz de borde
ko_kr: 림 라이트
zh_cn: 边缘光
zh_tw: 邊緣光

# RimEnabled
source: Enable Rim
ar_sa: تمكين الحافة
es_es: Habilitar borde
id_id: Aktifkan Rim
ko_kr: 림 라이트 활성화
zh_cn: 启用边缘光
zh_tw: 啟用邊緣光

# RimEnabled_Desc
source: Enables rim lighting.
ar_sa: يمكّن إضاءة الحافة.
es_es: Habilita la iluminación de borde.
id_id: Menambahkan cahaya di tepi model untuk menonjolkan bentuk.
ko_kr: 림 라이트를 활성화합니다.
zh_cn: 启用边缘光。
zh_tw: 啟用邊緣光。

source: Rim Color
ar_sa: لون الحافة
es_es: Color de borde
id_id: Warna Rim
ko_kr: 림 색상
zh_cn: 边缘光颜色
zh_tw: 邊緣光顏色

# RimColor_Desc
source: Sets the color of the rim light.
ar_sa: يحدد لون ضوء الحافة.
es_es: Establece el color de la luz de borde.
id_id: Mengatur warna rim light.
ko_kr: 림 라이트의 색상을 설정합니다.
zh_cn: 设置边缘光的颜色。
zh_tw: 設定邊緣光的顏色。

# RimIntensity
source: Intensity
ar_sa: كثافة
es_es: Intensidad
id_id: Intensitas
ko_kr: 강도
zh_cn: 强度
zh_tw: 強度

# RimIntensity_Desc
source: Sets the intensity of the rim light.
ar_sa: يحدد كثافة ضوء الحافة.
es_es: Establece la intensidad de la luz de borde.
id_id: Mengatur kecerahan rim light.
ko_kr: 림 라이트의 강도를 설정합니다.
zh_cn: 设置边缘光的强度。
zh_tw: 設定邊緣光的強度。

# RimPower
source: Power
ar_sa: قوة
es_es: Potencia
id_id: Kekuatan
ko_kr: 선명도
zh_cn: 锐度
zh_tw: 銳度

# RimPower_Desc
source: Sets the sharpness of the rim light.
ar_sa: يحدد حدة ضوء الحافة.
es_es: Establece la nitidez de la luz de borde.
id_id: Mengatur ketajaman rim light.
ko_kr: 림 라이트의 선명도를 설정합니다.
zh_cn: 设置边缘光的锐度。
zh_tw: 設定邊緣光的銳利度。

# Group_Outline
source: Outline
ar_sa: مخطط تفصيلي
es_es: Contorno
ko_kr: 윤곽선
zh_cn: 轮廓
zh_tw: 輪廓

# OutlineEnabled
source: Enable Outline
ar_sa: تمكين المخطط التفصيلي
es_es: Habilitar contorno
id_id: Aktifkan Outline
ko_kr: 윤곽선 활성화
zh_cn: 启用轮廓
zh_tw: 啟用輪廓

# OutlineEnabled_Desc
source: Enables outline rendering.
ar_sa: يمكّن تصيير المخطط التفصيلي.
es_es: Habilita la renderización de contornos.
id_id: Menggambar garis di batas dalam model.
ko_kr: 윤곽선 렌더링을 활성화합니다.
zh_cn: 启用轮廓渲染。
zh_tw: 啟用輪廓算繪。

source: Outline Color
ar_sa: لون المخطط التفصيلي
es_es: Color de contorno
id_id: Warna Outline
ko_kr: 윤곽선 색상
zh_cn: 轮廓颜色
zh_tw: 輪廓顏色

# OutlineColor_Desc
source: Sets the color of the outline.
ar_sa: يحدد لون المخطط التفصيلي.
es_es: Establece el color del contorno.
id_id: Mengatur warna outline.
ko_kr: 윤곽선의 색상을 설정합니다.
zh_cn: 设置轮廓的颜色。
zh_tw: 設定輪廓的顏色。

# OutlineWidth
source: Width
ar_sa: عرض
es_es: Ancho
id_id: Lebar Garis
ko_kr: 두께
zh_cn: 宽度
zh_tw: 寬度

# OutlineWidth_Desc
source: Sets the width of the outline.
ar_sa: يحدد عرض المخطط التفصيلي.
es_es: Establece el ancho del contorno.
id_id: Mengatur ketebalan garis outline.
ko_kr: 윤곽선의 두께를 설정합니다.
zh_cn: 设置轮廓的宽度。
zh_tw: 設定輪廓的寬度。

# OutlinePower
source: Threshold
ar_sa: عتبة
es_es: Umbral
id_id: Ambang
ko_kr: 임계값
zh_cn: 阈值
zh_tw: 閾值

# OutlinePower_Desc
source: Sets the threshold for outline detection.
ar_sa: يحدد عتبة اكتشاف المخطط التفصيلي.
es_es: Establece el umbral para la detección de contornos.
id_id: Mengatur seberapa jelas batas outline.
ko_kr: 윤곽선 감지 임계값을 설정합니다.
zh_cn: 设置轮廓检测的阈值。
zh_tw: 設定輪廓檢測的閾值。

# Group_Fog
source: Fog
ar_sa: ضباب
es_es: Niebla
id_id: Kabut
ko_kr: 안개
zh_cn: 雾
zh_tw: 霧

# FogEnabled
source: Enable Fog
ar_sa: تمكين الضباب
es_es: Habilitar niebla
id_id: Aktifkan Kabut
ko_kr: 안개 활성화
zh_cn: 启用雾
zh_tw: 啟用霧

# FogEnabled_Desc
source: Enables fog effect.
ar_sa: يمكّن تأثير الضباب.
es_es: Habilita el efecto de niebla.
id_id: Mengaktifkan efek kabut.
ko_kr: 안개 효과를 활성화합니다.
zh_cn: 启用雾效。
zh_tw: 啟用霧效。

source: Fog Color
ar_sa: لون الضباب
es_es: Color de niebla
id_id: Warna Kabut
ko_kr: 안개 색상
zh_cn: 雾颜色
zh_tw: 霧顏色

# FogColor_Desc
source: Sets the color of the fog.
ar_sa: يحدد لون الضباب.
es_es: Establece el color de la niebla.
id_id: Mengatur warna kabut.
ko_kr: 안개 색상을 설정합니다.
zh_cn: 设置雾的颜色。
zh_tw: 設定霧的顏色。

# FogStart
source: Start
ar_sa: بداية
es_es: Inicio
id_id: Mulai
ko_kr: 시작 거리
zh_cn: 开始距离
zh_tw: 開始距離

# FogStart_Desc
source: Sets the distance where fog starts.
ar_sa: يحدد المسافة التي يبدأ عندها الضباب.
es_es: Establece la distancia donde comienza la niebla.
id_id: Mengatur jarak mulai kabut dari kamera.
ko_kr: 안개가 시작되는 거리를 설정합니다.
zh_cn: 设置雾开始的距离。
zh_tw: 設定霧開始的距離。

# FogEnd
source: End
ar_sa: نهاية
es_es: Fin
id_id: Akhir
ko_kr: 종료 거리
zh_cn: 结束距离
zh_tw: 結束距離
