Repository: routersys/YMM4-ObjLoader
Catalog: ObjLoader/Localization/Texts.*.resx
Languages: ar_sa, es_es, id_id, ko_kr, zh_cn, zh_tw

# FogEnd_Desc
source: Sets the distance where fog is completely opaque.
ar_sa: يحدد المسافة التي يكون فيها الضباب معتمًا تمامًا.
es_es: Establece la distancia donde la niebla es completamente opaca.
id_id: Mengatur jarak di mana kabut sepenuhnya pekat.
ko_kr: 안개가 완전히 불투명해지는 거리를 설정합니다.
zh_cn: 设置雾完全不透明的距离。
zh_tw: 設定霧完全不透明的距離。

# FogDensity
source: Density
ar_sa: كثافة
es_es: Densidad
id_id: Kepadatan
ko_kr: 밀도
zh_cn: 密度
zh_tw: 密度

# FogDensity_Desc
source: Sets the density of the fog.
ar_sa: يحدد كثافة الضباب.
es_es: Establece la densidad de la niebla.
id_id: Mengatur kepadatan kabut.
ko_kr: 안개의 밀도를 설정합니다.
zh_cn: 设置雾的密度。
zh_tw: 設定霧的密度。

# Group_PostEffect
source: Effects
ar_sa: تأثيرات
es_es: Efectos
id_id: Efek
ko_kr: 효과
zh_cn: 特效
zh_tw: 特效

source: Saturation
ar_sa: تشبع
es_es: Saturación
id_id: Saturasi
ko_kr: 채도
zh_cn: 饱和度
zh_tw: 飽和度

# Saturation_Desc
source: Adjusts the color saturation.
ar_sa: يضبط تشبع اللون.
es_es: Ajusta la saturación del color.
id_id: Mengatur saturasi warna. 0 menjadi hitam putih.
ko_kr: 채도를 조정합니다.
zh_cn: 调整色彩饱和度。
zh_tw: 調整色彩飽和度。

source: Contrast
ar_sa: تباين
es_es: Contraste
id_id: Kontras
ko_kr: 대비
zh_cn: 对比度
zh_tw: 對比度

# Contrast_Desc
source: Adjusts the contrast.
ar_sa: يضبط التباين.
es_es: Ajusta el contraste.
id_id: Mengatur kontras.
ko_kr: 대비를 조정합니다.
zh_cn: 调整对比度。
zh_tw: 調整對比度。

source: Gamma
ar_sa: غاما
ko_kr: 감마
zh_cn: 伽马
zh_tw: 伽馬

# Gamma_Desc
source: Adjusts the gamma correction.
ar_sa: يضبط تصحيح غاما.
es_es: Ajusta la corrección gamma.
id_id: Mengatur koreksi gamma.
ko_kr: 감마 보정을 조정합니다.
zh_cn: 调整伽马校正。
zh_tw: 調整伽馬校正。

# BrightnessPost
source: Brightness
ar_sa: سطوع
es_es: Brillo
id_id: Kecerahan
ko_kr: 밝기
zh_cn: 亮度
zh_tw: 亮度

# BrightnessPost_Desc
source: Adjusts the brightness.
ar_sa: يضبط السطوع.
es_es: Ajusta el brillo.
id_id: Mengatur kecerahan keseluruhan layar.
ko_kr: 밝기를 조정합니다.
zh_cn: 调整亮度。
zh_tw: 調整亮度。

# Group_Vignette
source: Vignette
ar_sa: تظليل
es_es: Viñeta
ko_kr: 비네트
zh_cn: 暗角
zh_tw: 暗角

# VignetteEnabled
source: Enable
ar_sa: تمكين
es_es: Habilitar
id_id: Aktifkan
ko_kr: 활성화
zh_cn: 启用
zh_tw: 啟用

# VignetteEnabled_Desc
source: Enables vignette effect.
ar_sa: يمكّن تأثير التظليل.
es_es: Habilita el efecto de viñeta.
id_id: Menggelapkan sudut layar untuk suasana.
ko_kr: 비네트 효과를 활성화합니다.
zh_cn: 启用暗角效果。
zh_tw: 啟用暗角效果。

source: Vignette Color
ar_sa: لون التظليل
es_es: Color de viñeta
id_id: Warna Vignette
ko_kr: 비네트 색상
zh_cn: 暗角颜色
zh_tw: 暗角顏色

# VignetteColor_Desc
source: Sets the color of the vignette.
ar_sa: يحدد لون التظليل.
es_es: Establece el color de la viñeta.
id_id: Mengatur warna vignette.
ko_kr: 비네트의 색상을 설정합니다.
zh_cn: 设置暗角的颜色。
zh_tw: 設定暗角的顏色。

# VignetteIntensity
source: Intensity
ar_sa: كثافة
es_es: Intensidad
id_id: Intensitas
ko_kr: 강도
zh_cn: 强度
zh_tw: 強度

# VignetteIntensity_Desc
source: Sets the intensity of the vignette.
ar_sa: يحدد كثافة التظليل.
es_es: Establece la intensidad de la viñeta.
id_id: Mengatur intensitas vignette.
ko_kr: 비네트의 강도를 설정합니다.
zh_cn: 设置暗角的强度。
zh_tw: 設定暗角的強度。

# VignetteRadius
source: Radius
ar_sa: نصف القطر
es_es: Radio
ko_kr: 반지름
zh_cn: 半径
zh_tw: 半徑

# VignetteRadius_Desc
source: Sets the radius of the vignette.
ar_sa: يحدد نصف قطر التظليل.
es_es: Establece el radio de la viñeta.
id_id: Mengatur radius vignette.
ko_kr: 비네트의 반지름을 설정합니다.
zh_cn: 设置暗角的半径。
zh_tw: 設定暗角的半徑。

# VignetteSoftness
source: Softness
ar_sa: نعومة
es_es: Suavidad
id_id: Kelunakan
ko_kr: 부드러움
zh_cn: 柔和度
zh_tw: 柔和度

# VignetteSoftness_Desc
source: Sets the softness of the vignette edges.
ar_sa: يحدد نعومة حواف التظليل.
es_es: Establece la suavidad de los bordes de la viñeta.
id_id: Mengatur kelembutan tepi vignette.
ko_kr: 비네트 가장자리의 부드러움을 설정합니다.
zh_cn: 设置暗角边缘的柔和度。
zh_tw: 設定暗角邊緣的柔和度。

# Group_Scanline
source: Scanline
ar_sa: خط المسح
es_es: Línea de escaneo
ko_kr: 스캔라인
zh_cn: 扫描线
zh_tw: 掃描線

# ScanlineEnabled
source: Enable
ar_sa: تمكين
es_es: Habilitar
id_id: Aktifkan
ko_kr: 활성화
zh_cn: 启用
zh_tw: 啟用

# ScanlineEnabled_Desc
source: Enables scanline effect.
ar_sa: يمكّن تأثير خط المسح.
es_es: Habilita el efecto de línea de escaneo.
id_id: Menambahkan garis horizontal seperti TV tabung.
ko_kr: 스캔라인 효과를 활성화합니다.
zh_cn: 启用扫描线效果。
zh_tw: 啟用掃描線效果。

# ScanlineIntensity
source: Intensity
ar_sa: كثافة
es_es: Intensidad
id_id: Intensitas
ko_kr: 강도
zh_cn: 强度
zh_tw: 強度

# ScanlineIntensity_Desc
source: Sets the intensity of the scanlines.
ar_sa: يحدد كثافة خطوط المسح.
es_es: Establece la intensidad de las líneas de escaneo.
id_id: Mengatur kegelapan garis scanline.
ko_kr: 스캔라인의 강도를 설정합니다.
zh_cn: 设置扫描线的强度。
zh_tw: 設定掃描線的強度。

# ScanlineFrequency
source: Frequency
ar_sa: تردد
es_es: Frecuencia
id_id: Frekuensi
ko_kr: 주파수
zh_cn: 频率
zh_tw: 頻率

# ScanlineFrequency_Desc
source: Sets the frequency (number of lines) of the scanlines.
ar_sa: يحدد تردد (عدد خطوط) خطوط المسح.
es_es: Establece la frecuencia (número de líneas) de las líneas de escaneo.
id_id: Mengatur kepadatan garis scanline.
ko_kr: 스캔라인의 주파수(라인 수)를 설정합니다.
zh_cn: 设置扫描线的频率（行数）。
zh_tw: 設定掃描線的頻率（行數）。

# Group_Artistic
source: Artistic
ar_sa: فني
es_es: Artístico
id_id: Artistik
ko_kr: 예술
zh_cn: 艺术
zh_tw: 藝術

# ChromAbEnabled
source: Chromatic Aberration
ar_sa: انحراف لوني
es_es: Aberración cromática
id_id: Aberrasi kromatik
ko_kr: 색수차
zh_cn: 色差
zh_tw: 色差

# ChromAbEnabled_Desc
source: Enables chromatic aberration effect.
ar_sa: يمكّن تأثير الانحراف اللوني.
es_es: Habilita el efecto de aberración cromática.
id_id: Mengaktifkan efek aberasi kromatik.
ko_kr: 색수차 효과를 활성화합니다.
zh_cn: 启用色差效果。
zh_tw: 啟用色差效果。

# ChromAbIntensity
source: CA Intensity
ar_sa: كثافة CA
es_es: Intensidad CA
id_id: Intensitas CA
ko_kr: 색수차 강도
zh_cn: 色差强度
zh_tw: 色差強度

# ChromAbIntensity_Desc
source: Sets the intensity of chromatic aberration.
ar_sa: يحدد كثافة الانحراف اللوني.
es_es: Establece la intensidad de la aberración cromática.
id_id: Mengatur intensitas aberasi kromatik.
ko_kr: 색수차의 강도를 설정합니다.
zh_cn: 设置色差的强度。
zh_tw: 設定色差的強度。

# MonochromeEnabled
source: Monochrome
ar_sa: أحادي اللون
es_es: Monocromo
id_id: Monokrom
ko_kr: 흑백
zh_cn: 单色
zh_tw: 單色

# MonochromeEnabled_Desc
source: Enables monochrome effect.
ar_sa: يمكّن التأثير الأحادي اللون.
es_es: Habilita el efecto monocromático.
id_id: Mengubah layar menjadi monokrom.
ko_kr: 단색 효과를 활성화합니다.
zh_cn: 启用单色效果。
zh_tw: 啟用單色效果。

# MonochromeColor
source: Mono Color
ar_sa: لون أحادي
es_es: Color mono
id_id: Warna Mono
ko_kr: 흑백 색상
zh_cn: 单色颜色
zh_tw: 單色顏色

# MonochromeColor_Desc
source: Sets the color for monochrome effect.
ar_sa: يحدد اللون للتأثير الأحادي اللون.
es_es: Establece el color para el efecto monocromático.
id_id: Mengatur warna filter monokrom.
ko_kr: 단색 효과의 색상을 설정합니다.
zh_cn: 设置单色效果的颜色。
zh_tw: 設定單色效果的顏色。

# MonochromeMix
source: Mono Mix
ar_sa: مزج أحادي
es_es: Mezcla mono
id_id: Campuran Mono
ko_kr: 혼합량
zh_cn: 混合量
zh_tw: 混合量

# MonochromeMix_Desc
source: Sets the mix amount of monochrome effect.
ar_sa: يحدد مقدار المزج للتأثير الأحادي اللون.
es_es: Establece la cantidad de mezcla del efecto monocromático.
id_id: Mengatur seberapa banyak campuran antara warna asli dan filter mono.
ko_kr: 단색 효과의 혼합량을 설정합니다.
zh_cn: 设置单色效果的混合量。
zh_tw: 設定單色效果的混合量。

# PosterizeEnabled
source: Posterize
ar_sa: ملصق
es_es: Posterizar
ko_kr: 포스터화
zh_cn: 色调分离
zh_tw: 色調分離

# PosterizeEnabled_Desc
source: Enables posterization effect.
ar_sa: يمكّن تأثير الملصق.
es_es: Habilita el efecto de posterización.
id_id: Mengurangi jumlah warna untuk efek ilustrasi.
ko_kr: 포스터화 효과를 활성화합니다.
zh_cn: 启用色调分离效果。
zh_tw: 啟用色調分離效果。

# PosterizeLevels
source: Levels
ar_sa: مستويات
es_es: Niveles
id_id: Tingkat
ko_kr: 단계 수
zh_cn: 色阶数
zh_tw: 色階數

# PosterizeLevels_Desc
source: Sets the number of levels for posterization.
ar_sa: يحدد عدد المستويات للملصق.
es_es: Establece el número de niveles para la posterización.
id_id: Mengatur jumlah tingkat posterize.
ko_kr: 포스터화의 단계 수를 설정합니다.
zh_cn: 设置色调分离的色阶数。
zh_tw: 設定色調分離的色階數。

# WorldId_Desc
source: Specifies the World ID to switch settings.
ar_sa: يحدد معرف العالم لتبديل الإعدادات.
es_es: Especifica el ID del mundo para cambiar la configuración.
id_id: Menentukan ID dunia untuk mengganti pengaturan.
ko_kr: 설정을 전환할 월드 ID를 지정합니다.
zh_cn: 指定要切换设置的世界ID。
zh_tw: 指定要切換設定的世界ID。

# VCRedist_Title
source: Visual C++ Redistributable Missing
ar_sa: Visual C++ Redistributable مفقود
es_es: Falta Visual C++ Redistributable
id_id: Visual C++ Redistributable Hilang
ko_kr: Visual C++ 재배포 가능 패키지 누락
zh_cn: Visual C++ 可再发行组件丢失
zh_tw: Visual C++ 可轉散發套件遺失

# VCRedist_Message
source: Visual C++ 2015-2022 Redistributable (x64) is not installed. Some features may not work correctly. Please install it.
ar_sa: Visual C++ 2015-2022 Redistributable (x64) غير مثبت. قد لا تعمل بعض الميزات بشكل صحيح. الرجاء تثبيته.
es_es: Visual C++ 2015-2022 Redistributable (x64) no está instalado. Es posible que algunas funciones no funcionen correctamente. Por favor instálelo.
id_id: Visual C++ 2015-2022 Redistributable (x64) belum terpasang. Beberapa fitur mungkin tidak berfungsi. Harap pasang.
ko_kr: Visual C++ 2015-2022 재배포 가능 패키지(x64)가 설치되어 있지 않습니다. 일부 기능이 올바르게 작동하지 않을 수 있습니다. 설치해 주십시오.
zh_cn: 未安装 Visual C++ 2015-2022 可再发行组件 (x64)。某些功能可能无法正常工作。请安装。
zh_tw: 未安裝 Visual C++ 2015-2022 可轉散發套件 (x64)。某些功能可能無法正常運作。請安裝。

# Filter_3DModelFiles
source: 3D Model Files
ar_sa: ملفات نموذج 3D
es_es: Archivos de modelo 3D
id_id: File Model 3D
ko_kr: 3D 모델 파일
zh_cn: 3D 模型文件
zh_tw: 3D 模型檔案

# Filter_BlenderDeprecated
source: Blender File (Deprecated)
ar_sa: ملف Blender (مهمل)
es_es: Archivo Blender (Obsoleto)
id_id: File Blender (Tidak Disarankan)
ko_kr: Blender 파일 (비권장)
zh_cn: Blender 文件 (不推荐)
zh_tw: Blender 檔案 (不推薦)

# Filter_ShaderFiles
source: Shader Files
ar_sa: ملفات التظليل
es_es: Archivos de sombreador
id_id: File Shader
ko_kr: 셰이더 파일
zh_cn: 着色器文件
zh_tw: 著色器檔案

# Group_Assimp
source: Assimp Settings
ar_sa: إعدادات Assimp
id_id: Pengaturan Assimp
ko_kr: Assimp 설정
zh_cn: Assimp设置
zh_tw: Assimp設定

# Assimp_Obj
source: Load OBJ with Assimp
ar_sa: تحميل OBJ باستخدام Assimp
id_id: Muat OBJ dengan Assimp
ko_kr: Assimp로 OBJ 로드
zh_cn: 使用 Assimp 加载 OBJ
zh_tw: 使用 Assimp 載入 OBJ

# Assimp_Obj_Desc
source: Uses Assimp to load OBJ files.
ar_sa: يستخدم Assimp لتحميل ملفات OBJ.
id_id: Menggunakan Assimp untuk memuat file OBJ.
ko_kr: OBJ 파일 로드에 Assimp를 사용합니다.
zh_cn: 使用 Assimp 读取 OBJ 文件。
zh_tw: 使用 Assimp 讀取 OBJ 檔案。

# Assimp_Glb
source: Load GLB with Assimp
ar_sa: تحميل GLB باستخدام Assimp
id_id: Muat GLB dengan Assimp
ko_kr: Assimp로 GLB 로드
zh_cn: 使用 Assimp 加载 GLB
zh_tw: 使用 Assimp 載入 GLB

# Assimp_Glb_Desc
source: Uses Assimp to load GLB/GLTF files.
ar_sa: يستخدم Assimp لتحميل ملفات GLB/GLTF.
id_id: Menggunakan Assimp untuk memuat file GLB/GLTF.
ko_kr: GLB/GLTF 파일 로드에 Assimp를 사용합니다.
zh_cn: 使用 Assimp 读取 GLB/GLTF 文件。
zh_tw: 使用 Assimp 讀取 GLB/GLTF 檔案。

# Assimp_Ply
source: Load PLY with Assimp
ar_sa: تحميل PLY باستخدام Assimp
id_id: Muat PLY dengan Assimp
ko_kr: Assimp로 PLY 로드
zh_cn: 使用 Assimp 加载 PLY
zh_tw: 使用 Assimp 載入 PLY

# Assimp_Ply_Desc
source: Uses Assimp to load PLY files.
ar_sa: يستخدم Assimp لتحميل ملفات PLY.
id_id: Menggunakan Assimp untuk memuat file PLY.
ko_kr: PLY 파일 로드에 Assimp를 사용합니다.
zh_cn: 使用 Assimp 读取 PLY 文件。
zh_tw: 使用 Assimp 讀取 PLY 檔案。

# Assimp_Stl
source: Load STL with Assimp
ar_sa: تحميل STL باستخدام Assimp
id_id: Muat STL dengan Assimp
ko_kr: Assimp로 STL 로드
zh_cn: 使用 Assimp 加载 STL
zh_tw: 使用 Assimp 載入 STL

# Assimp_Stl_Desc
source: Uses Assimp to load STL files.
ar_sa: يستخدم Assimp لتحميل ملفات STL.
id_id: Menggunakan Assimp untuk memuat file STL.
ko_kr: STL 파일 로드에 Assimp를 사용합니다.
zh_cn: 使用 Assimp 读取 STL 文件。
zh_tw: 使用 Assimp 讀取 STL 檔案。

# Assimp_3mf
source: Load 3MF with Assimp
ar_sa: تحميل 3MF باستخدام Assimp
id_id: Muat 3MF dengan Assimp
ko_kr: Assimp로 3MF 로드
zh_cn: 使用 Assimp 加载 3MF
zh_tw: 使用 Assimp 載入 3MF

# Assimp_3mf_Desc
source: Uses Assimp to load 3MF files.
ar_sa: يستخدم Assimp لتحميل ملفات 3MF.
id_id: Menggunakan Assimp untuk memuat file 3MF.
ko_kr: 3MF 파일 로드에 Assimp를 사용합니다.
zh_cn: 使用 Assimp 读取 3MF 文件。
zh_tw: 使用 Assimp 讀取 3MF 檔案。

# Assimp_Pmx
source: Load PMX with Assimp
ar_sa: تحميل PMX باستخدام Assimp
id_id: Muat PMX dengan Assimp
ko_kr: Assimp로 PMX 로드
zh_cn: 使用 Assimp 加载 PMX
zh_tw: 使用 Assimp 載入 PMX

# Assimp_Pmx_Desc
source: Uses Assimp to load PMX files.
ar_sa: يستخدم Assimp لتحميل ملفات PMX.
id_id: Menggunakan Assimp untuk memuat file PMX.
ko_kr: PMX 파일 로드에 Assimp를 사용합니다.
zh_cn: 使用 Assimp 读取 PMX 文件。
zh_tw: 使用 Assimp 讀取 PMX 檔案。

# LayerSettings
source: Layers
ar_sa: طبقات
id_id: Layer
ko_kr: 레이어
zh_cn: 图层
zh_tw: 圖層

# Layer_Add
source: Add Layer
ar_sa: إضافة طبقة
id_id: Tambah Layer
ko_kr: 레이어 추가
zh_cn: 添加图层
zh_tw: 新增圖層

# Layer_Remove
source: Remove Layer
ar_sa: إزالة طبقة
id_id: Hapus Layer
ko_kr: 레이어 삭제
zh_cn: 删除图层
zh_tw: 刪除圖層

# Layer_MoveUp
source: Move Up
ar_sa: تحريك لأعلى
id_id: Pindah ke Atas
ko_kr: 위로 이동
zh_cn: 上移
zh_tw: 上移

# Layer_MoveDown
source: Move Down
ar_sa: تحريك لأسفل
id_id: Pindah ke Bawah
ko_kr: 아래로 이동
zh_cn: 下移
zh_tw: 下移

# Layer_New
source: New Layer
ar_sa: طبقة جديدة
id_id: Layer Baru
ko_kr: 새 레이어
zh_cn: 新建图层
zh_tw: 新建圖層

# UpdateNotificationTitle
source: ObjLoader Update Notification
ar_sa: إشعار تحديث ObjLoader
id_id: Pemberitahuan Pembaruan ObjLoader
ko_kr: ObjLoader 업데이트 알림
zh_cn: ObjLoader 更新通知
zh_tw: ObjLoader 更新通知

# UpdateNotificationMessage
source: A new version ({0}) is available.\nDo you want to open the distribution page?
ar_sa: يتوفر إصدار جديد ({0}).\nهل تريد فتح صفحة التوزيع؟
id_id: Versi baru ({0}) tersedia.\nBuka halaman distribusi?
ko_kr: 새 버전 ({0})을 사용할 수 있습니다.\n배포 페이지를 여시겠습니까?
zh_cn: 新版本 ({0}) 可用。\n是否打开发布页面？
zh_tw: 新版本 ({0}) 可用。\n是否開啟發佈頁面？

source: Render Quality
ar_sa: جودة التصيير
id_id: Kualitas Render
ko_kr: 렌더링 품질
zh_cn: 渲染质量
zh_tw: 渲染品質

# RenderQuality_Desc
source: Sets the rendering quality of the 3D model. Higher quality increases load.
ar_sa: يحدد جودة تصيير النموذج ثلاثي الأبعاد. الجودة الأعلى تزيد الحمل.
id_id: Mengatur kualitas render model 3D. Kualitas lebih tinggi meningkatkan beban.
ko_kr: 3D 모델의 렌더링 품질을 설정합니다. 높을수록 깨끗하지만 부하가 증가합니다.
zh_cn: 设置3D模型的渲染质量。质量越高，负载越大。
zh_tw: 設定3D模型的渲染品質。品質越高，負載越大。

# RenderQuality_High
source: High (2x SSAA)
ar_sa: عالية (2x SSAA)
id_id: Tinggi (2x SSAA)
ko_kr: 고품질 (2x SSAA)
zh_cn: 高质量 (2x SSAA)
zh_tw: 高品質 (2x SSAA)

# RenderQuality_Standard
source: Standard
ar_sa: قياسي
id_id: Standar
ko_kr: 표준
zh_cn: 标准
zh_tw: 標準

# RenderQuality_Low
source: Low
ar_sa: منخفضة
id_id: Rendah
ko_kr: 저품질
zh_cn: 低质量
zh_tw: 低品質

# Button_Setting
source: Settings
ar_sa: إعدادات
id_id: Pengaturan
ko_kr: 설정
zh_cn: 设置
zh_tw: 設定

# Button_Layer
source: Layers
ar_sa: طبقات
id_id: Layer
ko_kr: 레이어
zh_cn: 图层
zh_tw: 圖層

# Button_Split
source: Split
ar_sa: إنقسام
id_id: Membagi
ko_kr: 분해
zh_cn: 分解
zh_tw: 分解

# SplitWindow_Title
source: Split
ar_sa: إنقسام
id_id: Membagi
ko_kr: 분해
zh_cn: 分解
zh_tw: 分解

# SplitWindow_Parts
source: Parts List
ar_sa: قائمة الأجزاء
id_id: Daftar Bagian
ko_kr: 부품 목록
zh_cn: 部件列表
zh_tw: 部件列表

# SplitWindow_All
source: All
ar_sa: الجميع
id_id: Semua
ko_kr: 전체
zh_cn: 全部
zh_tw: 全部

# SplitWindow_PartName
source: Part {0}
ar_sa: الجزء {0}
id_id: Bagian {0}
ko_kr: 부품 {0}
zh_cn: 部件 {0}
zh_tw: 部件 {0}

# SplitWindow_Faces
source: Polygons: {0}
ar_sa: مضلعات: {0}
id_id: Poligon: {0}
ko_kr: 폴리곤 수: {0}
zh_cn: 面数: {0}
zh_tw: 面數: {0}

# SplitWindow_AddToLayer
source: Add to Layer
ar_sa: إضافة إلى طبقة
id_id: Tambahkan ke Layer
ko_kr: 레이어에 추가
zh_cn: 添加至图层
zh_tw: 添加至圖層

# Button_CenterPoint
source: Rotation Center
ar_sa: مركز الدوران
id_id: Pusat Rotasi
ko_kr: 회전 중심
zh_cn: 旋转中心
zh_tw: 旋轉中心

# Window_CenterPoint
source: Rotation Center Settings
ar_sa: إعدادات مركز الدوران
id_id: Pengaturan Pusat Rotasi
ko_kr: 회전 중심 설정
zh_cn: 旋转中心设置
zh_tw: 旋轉中心設定

# Msg_CenterPointDesc
source: Sets the rotation center coordinates for the selected layer.
ar_sa: يحدد إحداثيات مركز الدوران للطبقة المحددة.
id_id: Mengatur koordinat pusat rotasi untuk layer yang dipilih.
ko_kr: 선택한 레이어의 회전 중심 좌표를 설정합니다.
zh_cn: 设置所选图层的旋转中心坐标。
zh_tw: 設定所選圖層的旋轉中心座標。

# Group_Selection
source: 3D Selection
ar_sa: تحديد ثلاثي الأبعاد
id_id: Pilihan 3D
ko_kr: 3D 선택
zh_cn: 3D选择
zh_tw: 3D選擇

# Msg_HoverInfo
source: Automatically recognizes vertices
ar_sa: 3D 뷰에서 마우스를 가져가면 정점
id_id: 가장자리
ko_kr: 在3D视图中鼠标悬停时自动识别顶点、边和面。
zh_cn: edges
zh_tw: and faces when hovering over them in the 3D view.

# Button_ApplySelection
source: Apply Detected Coordinates
ar_sa: تطبيق الإحداثيات المكتشفة
id_id: Terapkan Koordinat yang Terdeteksi
ko_kr: 감지된 좌표 적용
zh_cn: 应用检测到的坐标
zh_tw: 應用檢測到的座標

# State_None
source: None
ar_sa: لا شيء
id_id: Tidak ada
ko_kr: 없음
zh_cn: 无
zh_tw: 無

# Dialog_Close
source: Close
ar_sa: إغلاق
id_id: Tutup
ko_kr: 닫기
zh_cn: 关闭
zh_tw: 關閉

# State_Scanning
source: Scanning...
ar_sa: مسح...
id_id: Memindai...
ko_kr: 스캔 중...
zh_cn: 扫描中...
zh_tw: 掃描中...

# State_Locked
source: Locked
ar_sa: مقفل
id_id: Terkunci
ko_kr: 잠김
zh_cn: 已锁定
zh_tw: 已鎖定

# Mode_Vertex
source: Vertex
ar_sa: قمة
id_id: Titik Sudut
ko_kr: 정점
zh_cn: 顶点
zh_tw: 頂點

# Mode_Edge
source: Edge
ar_sa: حافة
id_id: Tepi
ko_kr: 모서리
zh_cn: 边
zh_tw: 邊

# Mode_Face
source: Face
ar_sa: Wajah
ko_kr: Cara
zh_cn: 面
zh_tw: 면

# Layer_Rename
source: Double click to rename
ar_sa: إعادة تسمية
id_id: Klik dua kali untuk mengganti nama
ko_kr: 더블 클릭하여 이름 변경
zh_cn: 双击重命名
zh_tw: 雙擊重新命名

# Layer_Visibility_Show
source: Show
ar_sa: إظهار
id_id: Tampilkan
ko_kr: 표시
zh_cn: 显示
zh_tw: 顯示

# Layer_Visibility_Hide
source: Hide
ar_sa: إخفاء
id_id: Sembunyikan
ko_kr: 숨기기
zh_cn: 隐藏
zh_tw: 隱藏

# Layer_PartName
source: Part {0}
ar_sa: جزء {0}
id_id: Bagian {0}
ko_kr: 부품 {0}
zh_cn: 部件 {0}
zh_tw: 部件 {0}

# Menu_File
source: File
ko_kr: 파일
zh_cn: 文件
zh_tw: 檔案

# Menu_Open
source: Open
id_id: Buka
ko_kr: 열기
zh_cn: 打开
zh_tw: 開啟

# Menu_Save
source: Save
id_id: Simpan
ko_kr: 저장
zh_cn: 保存
zh_tw: 儲存

# Menu_SaveAs
source: Save As
id_id: Simpan Sebagai
ko_kr: 다른 이름으로 저장
zh_cn: 另存为
zh_tw: 另存新檔

# Menu_Exit
source: Close
id_id: Tutup
ko_kr: 닫기
zh_cn: 关闭
zh_tw: 關閉

# Menu_Edit
source: Edit
ko_kr: 편집
zh_cn: 编辑
zh_tw: 編輯

# Menu_Undo
source: Undo
ko_kr: 실행 취소
zh_cn: 撤销
zh_tw: 復原

# Menu_Redo
source: Redo
ko_kr: 다시 실행
zh_cn: 重做
zh_tw: 重做

# Msg_ProjectFileFilter
source: Camera Project File
id_id: File Proyek Kamera
ko_kr: 카메라 프로젝트 파일
zh_cn: 相机项目文件
zh_tw: 相機專案檔

# Msg_FailedToLoad
source: Failed to load: {0}
id_id: Gagal memuat: {0}
ko_kr: 로드 실패: {0}
zh_cn: 加载失败: {0}
zh_tw: 載入失敗: {0}

# Msg_FailedToSave
source: Failed to save: {0}
id_id: Gagal menyimpan: {0}
ko_kr: 저장 실패: {0}
zh_cn: 保存失败: {0}
zh_tw: 儲存失敗: {0}

source: Light Type
id_id: Jenis Cahaya
ko_kr: 조명 유형
zh_cn: 灯光类型
zh_tw: 燈光類型

# LightType_Point
source: Point
id_id: Titik
ko_kr: 포인트
zh_cn: 点光
zh_tw: 點光

# LightType_Spot
source: Spot
ko_kr: 스포트
zh_cn: 聚光
zh_tw: 聚光

# LightType_Sun
source: Sun
id_id: Matahari
ko_kr: 태양
zh_cn: 日光
zh_tw: 日光

# LightType_Area
source: Area
ko_kr: 영역
zh_cn: 区域
zh_tw: 區域

# Shadow_Enabled
source: Enable Shadow
id_id: Aktifkan Bayangan
ko_kr: 그림자 사용
zh_cn: 启用阴影
zh_tw: 啟用陰影

source: Shadow Resolution
id_id: Resolusi Bayangan
ko_kr: 그림자 해상도
zh_cn: 阴影分辨率
zh_tw: 陰影解析度

source: Shadow Bias
id_id: Bias Bayangan
ko_kr: 그림자 바이어스
zh_cn: 阴影偏差
zh_tw: 陰影偏差

source: Shadow Strength
id_id: Kekuatan Bayangan
ko_kr: 그림자 강도
zh_cn: 阴影强度
zh_tw: 陰影強度

# SunLight_ShadowRange
source: Sun Shadow Range
id_id: Rentang Bayangan Matahari
ko_kr: 태양 그림자 범위
zh_cn: 日光阴影范围
zh_tw: 日光陰影範圍

# Group_Shadow
source: Shadow Settings
id_id: Pengaturan Bayangan
ko_kr: 그림자 설정
zh_cn: 阴影设置
zh_tw: 陰影設置

# Shadow_Enabled_Desc
source: Toggle shadow rendering.
id_id: Beralih rendering bayangan.
ko_kr: 그림자 렌더링 전환.
zh_cn: 切换阴影渲染。
zh_tw: 切換陰影渲染。

# Shadow_Resolution_Desc
source: Texture resolution for shadow mapping.
id_id: Resolusi tekstur untuk pemetaan bayangan.
ko_kr: 그림자 매핑을 위한 텍스처 해상도.
zh_cn: 阴影贴图的纹理分辨率。
zh_tw: 陰影貼圖的紋理分辨率。

# Shadow_Bias_Desc
source: Offset to prevent shadow acne.
id_id: Offset untuk mencegah jerawat bayangan.
ko_kr: 그림자 여드름을 방지하기 위한 오프셋.
zh_cn: 防止阴影痤疮的偏移。
zh_tw: 防止陰影痤瘡的偏移。

# Shadow_Strength_Desc
source: Darkness of the shadows.
id_id: Kegelapan bayangan.
ko_kr: 그림자의 어두운 정도 설정.
zh_cn: 设置阴影的深浅。
zh_tw: 設置陰影的深淺。

# SunLight_ShadowRange_Desc
source: Area size covered by sun shadows.
id_id: Ukuran area yang dicakup oleh bayangan matahari.
ko_kr: 태양 그림자가 커버하는 영역 크기.
zh_cn: 太阳阴影覆盖的区域大小。
zh_tw: 太陽陰影覆蓋的區域大小。

# ShadowMode
source: Shadow Generation
id_id: Pembuatan Bayangan
ko_kr: 그림자 생성
zh_cn: 阴影生成
zh_tw: 陰影生成

# ShadowMode_Desc
source: Toggles shadow generation for this World ID setting.
id_id: Mengalihkan pembuatan bayangan untuk pengaturan ID Dunia ini.
ko_kr: 이 월드 ID 설정에 대한 그림자 생성을 전환합니다.
zh_cn: 切换此世界ID设置的阴影生成。
zh_tw: 切換此世界ID設定的陰影生成。

source: Cascaded Shadows
id_id: Bayangan Bertingkat
ko_kr: 계단식 그림자
zh_cn: 级联阴影
zh_tw: 級聯陰影

# CascadedShadows_Desc
source: Enables Cascaded Shadow Maps to improve shadow quality.
id_id: Mengaktifkan Peta Bayangan Bertingkat untuk meningkatkan kualitas bayangan.
ko_kr: 계단식 그림자 매핑을 활성화하여 그림자 품질을 향상시킵니다.
zh_cn: 启用级联阴影贴图以提高阴影质量。
zh_tw: 啟用級聯陰影貼圖以提高陰影品質。

# Group_PBR
source: PBR Settings
id_id: Pengaturan PBR
ko_kr: PBR 설정
zh_cn: PBR设置
zh_tw: PBR設定

source: Metallic
ko_kr: 메탈릭
zh_cn: 金属度
zh_tw: 金屬度

# Metallic_Desc
source: Sets the metallic property of the surface.
id_id: Mengatur sifat logam dari permukaan.
ko_kr: 표면의 금속성을 설정합니다.
zh_cn: 设置表面的金属度。
zh_tw: 設定表面的金屬度。

source: Roughness
id_id: Kekasaran
ko_kr: 거칠기
zh_cn: 粗糙度
zh_tw: 粗糙度

# Roughness_Desc
source: Sets the roughness of the surface. Affects reflection blur.
id_id: Mengatur kekasaran permukaan. Mempengaruhi blur refleksi.
ko_kr: 표면의 거칠기를 설정합니다. 반사 흐림에 영향을 줍니다.
zh_cn: 设置表面的粗糙度。影响反射模糊。
zh_tw: 設定表面的粗糙度。影響反射模糊。

source: IBL Intensity
id_id: Intensitas IBL
ko_kr: IBL 강도
zh_cn: 环境光强度 (IBL)
zh_tw: 環境光強度 (IBL)

# IBLIntensity_Desc
source: Sets the intensity of Image Based Lighting.
id_id: Mengatur intensitas Pencahayaan Berbasis Gambar.
ko_kr: 이미지 기반 조명의 강도를 설정합니다.
zh_cn: 设置基于图像的照明强度。
zh_tw: 設定基於圖像的照明強度。

# SSREnabled
source: Enable SSR
id_id: Aktifkan SSR
ko_kr: SSR 활성화
zh_cn: 启用SSR
zh_tw: 啟用SSR

# SSREnabled_Desc
source: Enables Screen Space Reflections.
id_id: Mengaktifkan Refleksi Ruang Layar.
ko_kr: 화면 공간 반사를 활성화합니다.
zh_cn: 启用屏幕空间反射。
zh_tw: 啟用螢幕空間反射。

# SSRStep
source: Step Size
id_id: Ukuran Langkah
ko_kr: 단계 크기
zh_cn: 步长
zh_tw: 步長

# SSRStep_Desc
source: Sets the precision of reflection calculation.
id_id: Mengatur presisi perhitungan refleksi.
ko_kr: 반사 계산의 정밀도를 설정합니다.
zh_cn: 设置反射计算的精度。
zh_tw: 設定反射計算的精度。

# SSRMaxDist
source: Max Distance
id_id: Jarak Maksimum
ko_kr: 최대 거리
zh_cn: 最大距离
zh_tw: 最大距離

# SSRMaxDist_Desc
source: Sets the maximum distance for reflection calculation.
id_id: Mengatur jarak maksimum untuk perhitungan refleksi.
ko_kr: 반사 계산의 최대 거리를 설정합니다.
zh_cn: 设置反射计算的最大距离。
zh_tw: 設定反射計算的最大距離。

# PcssLightSize
source: Light Size
id_id: Ukuran Cahaya
ko_kr: 광원 크기
zh_cn: 光源大小
zh_tw: 光源大小

# PcssLightSize_Desc
source: Sets the size of the light source. Affects shadow softness.
id_id: Mengatur ukuran sumber cahaya. Mempengaruhi kelembutan bayangan.
ko_kr: 광원의 크기를 설정합니다. 그림자 부드러움에 영향을 줍니다.
zh_cn: 设置光源的大小。影响阴影柔和度。
zh_tw: 設定光源的大小。影響陰影柔和度。

# PcssQuality
source: Shadow Quality
id_id: Kualitas Bayangan
ko_kr: 그림자 품질
zh_cn: 阴影质量
zh_tw: 陰影品質

# PcssQuality_Desc
source: Sets the number of samples for soft shadows.
id_id: Mengatur jumlah sampel untuk bayangan lembut.
ko_kr: 소프트 섀도우의 샘플 수를 설정합니다.
zh_cn: 设置软阴影的采样数。
zh_tw: 設定軟陰影的採樣數。

# ScanlinePost
source: Apply After Tonemap
id_id: Terapkan Setelah Tonemap
ko_kr: 톤매핑 후 적용
zh_cn: 色调映射后应用
zh_tw: 色調映射後應用

# ScanlinePost_Desc
source: Applies scanlines after tone mapping.
id_id: Menerapkan scanlines setelah tone mapping.
ko_kr: 톤매핑 후에 스캔라인을 적용합니다.
zh_cn: 在色调映射之后应用扫描线。
zh_tw: 在色調映射之後應用掃描線。

# SplitWindow_MaterialSettings
source: Material Settings
id_id: Pengaturan Material
ko_kr: 재질 설정
zh_cn: 材质设置
zh_tw: 材質設定

# SplitWindow_MaterialPreset
source: Material Preset
id_id: Preset Material
ko_kr: 재질 프리셋
zh_cn: 材质预设
zh_tw: 材質預設
